 [
    {
        "title": "Music4MyEyes",
        "subtitle": "3D Music Player and Visualizer",
        "videoLink": "https://www.youtube.com/embed/bV333_Ob6Fs",
        "body": "<p>Music4MyEyes is a interactive music visualizer which displays different shapes, colors, and animations depending on the frequency and amplitude of the music. Users can choose from 12 different visualizations. For instance, one visualization resembles mountains with different colors for elevation such as blue for the lower one, yellow for the middle, and red for the top. Another visualization looks like a pool of water with drops of water that jump out of the water at the rhythm of the music.</p><p>The visualizer has versatile controls. It allows the user to rotate, move and zoom in and out.</p><p>Music4MyEyes comes preloaded with music from <a href='https://www.youtube.com/channel/UC-krsb7zyB9sNB_JZaRIHzA'>OsoX</a>, but users can also load their own music. In this way the app works also works as a music player. The preloaded songs were carefully selected to complement the style of the respective visualizations. The music player has seven different buckets where users are able to load music tracks. After the music is loaded users can select a track and play, pause, forward, or rewind.</p>",
        "links": [
            {
                "text": "Download Music4MyEyes",
                "address": "downloads/Music4MyEyes_Win32.zip"
            },
            {
                "text": "GitHub Repository",
                "address": "https://github.com/mariabethania/Music4MyEyes"
            },
            {
                "text": "Youtube Demo",
                "address": "https://www.youtube.com/embed/bV333_Ob6Fs"
            }
            
        ]
    },
    {
        "title": "The Matrix 3D",
        "subtitle": "Interactive 3D matrix code",
        "videoLink": "https://www.youtube.com/embed/bV333_Ob6Fs",
        "body": "<p>The Matrix 3D is a real time recreation of the falling code from the movie The Matrix. The code is generated in real time and is random so it's' different each time the users run the application. Users are able to navigate around the code using the to move, rotate, and zoom in. Music from the music plays in the background and is synchronized with the timing of the graphics.</p><p>I worked hard to make sure that the code and animation looks exactly like the in the movie. For instance, I made sure to use katakana instead of regular western letters. The framerate was kept at 15fps to give the sharp feeling to the animation. When a new character is created it glows bright green, and older characters fade out gradually as more time passes until the whole line of characters disappears.</p><p>One more interesting feature is the yellow source of radiating code that represents 'the source' which is another theme from the movie. I also build it to look like the one from the movie.</p>",
        "links": [
            {
                "text": "Download The Matrix 3D",
                "address": "downloads/TheMatrix3D_Windows_32.zip"
            },
            {
                "text": "GitHub Repository",
                "address": "https://github.com/mariabethania/TheMatrix3D"
            },
            {
                "text": "Youtube Demo",
                "address": "#"
            }
            
        ]
    },
    {
        "title": "Solar System 3D",
        "subtitle": "Solar system that dances to the music",
        "videoLink": "https://www.youtube.com/embed/bV333_Ob6Fs",
        "body": "<p>Solar System 3D is a music visualizer that has the planets of the solar system dancing to the rhythm of the music. It displays the Sun at the center and the nine planets in orbit around it in the correct order. Each planet looks realistic with the correct colors and textures. Users are able to load any song they want from their hard drive. As the music plays the planets change their size and color to the rhythm of the music and also depending on the intensity of the sounds.</p>",
        "links": [
            {
                "text": "Download Solar System 3D",
                "address": "downloads/SolarSystem3D_Win_32.zip"
            },
            {
                "text": "GitHub Repository",
                "address": "https://github.com/mariabethania/SolarSystem"
            },
            {
                "text": "Youtube Demo",
                "address": "#"
            }
            
        ]
    },
    {
        "title": "Hot PingPong",
        "subtitle": "3D ping pong game",
        "videoLink": "https://www.youtube.com/embed/bV333_Ob6Fs",
        "body": "<p>Hot PingPong is a 3D reinterpretation of the classic 2d Atari game Pong. There are two player rackets each represented by a rectangular box and a ball which bounces off of the rackets and the walls. The objective is to get the ball past the opponent's rackets into the goal which is the entire side wall. The faster the ball moves the hotter it gets which is represented by more intense fire effects.</p><p>There are three play modes: one player against AI, two players, and AI vs AI. The AI is fine-tuned to feel like a real human player. In two player mode the player in the left controls its racket with the w and s keys while the right player uses the upwards and downwards arrows. In AI vs AI mode one AI plays another AI which looks like a real game where two humans are playing.</p>",
        "links": [
            {
                "text": "Download Hot PingPong",
                "address": "downloads/HotPingPong_Windows32.zip"
            },
            {
                "text": "GitHub Repository",
                "address": "https://github.com/mariabethania/HotPingPong"
            },
            {
                "text": "YouTube Demo",
                "address": "#"
            }
            
        ]
    },
    {
        "title": "FreeKick",
        "subtitle": "3D Soccer Game",
        "videoLink": "https://www.youtube.com/embed/bV333_Ob6Fs",
        "body": "<p>FreeKick is a 3D soccer shoot out game. The players must kick the ball and try to score against the AI goalie. Players can choose the position of the foot and the power of the kick. The AI goalie moves in realistic ways to accurately emulate the behavior of an actual human player.</p><p>The game has two modes: front facing and side view. In other words, the user can change the camera to two different positions which in turn affects the gameplay. For instance, the front facing mode gives the player a first person point of view which results in a more realistic gameplay. On the other hand, the side view mode gives the player a third person point of view and results in a arcade style of gameplay.</p>",
        "links": [
            {
                "text": "Download FreeKick",
                "address": "downloads/FreeKick_windows_32.zip"
            },
            {
                "text": "GitHub Repository",
                "address": "https://github.com/mariabethania/FreeKick"
            },
            {
                "text": "Youtube Demo",
                "address": "#"
            }
            
        ]
    }
 
 ]
 
